Use Kurs
GO

Insert Employees
	(Имя, Фамилия, Отчество, Должность, Зарплата, Телефон, Адрес, Логин, Пароль)
		Values 
			('Никита', 'Шеве', 'Максимович', 'Директор', '100000', '89815553646', 'Политех, Спб', 'DIREKTOR', 'ROOT'),
			('Ира', 'Цыгарова', 'Николаевна', 'Администратор', '50000', '88005554545', 'Политех, Спб', 'ADMIN_1', 'AdminRoot'),
			('Дмитрий', 'Луценко', 'Юрьевич', 'Администратор', '50000', '82281488888', 'Политех, Спб', 'ADMIN_2', 'AdminRoot'),
			('Георгий', 'Разнобарский', 'Михайлович', 'Бармен', '35000', '89817468998', 'СпбГУ, Спб', 'BAR_1', 'BarRoot'),
			('Лаки', 'Инобор', '-----', 'Бармен', '35000', '89999999999', 'Epam System, Спб', 'BAR_2', 'BarRoot');
GO

select * from Employees
GO

insert Actors
	(Имя, Фамилия, Страна, Дата_рождения)
		values
			('Робет', 'Паттинсон', 'Англия', '13.05.1986'),
			('Джон', 'Дэвид', 'США', '28.07.1984'),
			('Кеннет', 'Брана', 'Англия', '10.12.1960'),
			('Брэд', 'Питт', 'США', '18.12.1963'),
			('Тиль', 'Швайгер', 'Германия', '19.12.1963'),
			('Кристоф', 'Вальц', 'Австрия', '04.10.1956'),
			('Том', 'Хэнкс', 'США', '09.07.1956'),
			('Стэнли', 'Туччи', 'США', '11.11.1960'),
			('Кэтрин', 'Зета-Джонс', 'Англия', '25.09.1969');
go

select * from Actors
go

select FilmsInfoID, Название from FilmsInfo
go

Insert Films_Actors
	(FilmsIfoID, ActorsID)
		Values
			('4', '1'),
			('4', '2'),
			('4', '3'),
			('4', '7'),
			('5', '4'),
			('5', '5'),
			('5', '6'),
			('6', '7'),
			('6', '8'),
			('6', '9');
go


select * from Films_Actors
go

insert Hall
	(Зал, Всего_мест, Всего_рядов)
		values
			('Без последнего ряда', '50', '5'),
			('Райское кресло', '70', '7'),
			('20 минут рекламы', '44', '4'),
			('Без детей', '20', '5');
go

insert Films
	(FilmsIfoID, HallID, Цена_билета, Билеты, Дата, Время)
		values
			('4', '3', '100', '44', '12.12.2020', '10:00'),
			('4', '3', '150', '44', '12.12.2020', '12:00'),
			('4', '3', '250', '44', '12.12.2020', '16:00'),
			('4', '2', '300', '70', '12.12.2020', '19:00'),
			('5', '2', '120', '70', '12.12.2020', '13:00'),
			('5', '1', '230', '50', '12.12.2020', '13:30'),
			('5', '1', '250', '50', '12.12.2020', '16:30'),
			('5', '4', '200', '20', '12.12.2020', '14:00'),
			('6', '4', '300', '20', '12.12.2020', '20:00'),
			('6', '2', '100', '70', '12.12.2020', '10:00'),
			('6', '1', '200', '50', '12.12.2020', '21:00');
go

--select * from Films
--select * from FilmsInfo
--select * from Hall
